huming2207/soulcloud_client_demo/sdkconfig.defaults
# Soulcloud client demo — ESP32-S3 devkitc-1 (8 MB flash + 8 MB octal PSRAM)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# PSRAM (octal, 80 MHz, auto-detect type)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Custom partition table: nvs + otadata + dual OTA app slots
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# MQTT over WebSocket transport (defaults are already y; pinned explicitly)
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_WS_TRANSPORT=y
CONFIG_WS_BUFFER_SIZE=4096

# OpenETH driver compiled in (used by the QEMU ethernet demo mode)
CONFIG_ETH_USE_OPENETH=y
